app/graphql/mutations/users/create_user.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
      def resolve(attributes:)
        attr = attributes.to_h
        ::User.create!(attr)