app/graphql/mutations/users/delete_user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
      def resolve(id:)
        user = ::User.find(id)
        authorize! user, to: :manage?
        user.destroy!