app/graphql/mutations/users/update_user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "role" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-09-23 13:44:02.645184"], ["role", "admin"], ["id", 4]]
---
      def resolve(id:, attributes:)
        attr = attributes.to_h
        user = ::User.find(id)
        authorize! user, to: :manage?
        user.update!(attr)