app/graphql/queries/user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def resolve(id:)
      ::User.find(id)