app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" ASC LIMIT $1  [["LIMIT", 1]]
---
      def index
        users = User.order(:created_at)

INSERT INTO "users" ("first_name", "last_name", "email", "role", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
        user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
      def destroy
        user = User.find(params[:id])
        user.destroy!