app/models/user.rb

  def self.handle_login(params)
    hashParams = HashWithIndifferentAccess.new(params)
    user = User.find_by(email: hashParams['email'])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]